doom/.doom.d/config.org
#+TITLE: Doom Emacs configuration
#+AUTHOR: Marco Pas
#+EMAIL: marco.pasopas@gmail.com
#+EXPORT_FILE_NAME: README.md
#+PROPERTY: header-args:emacs-lisp :tangle config.el
#+STARTUP: fold

* Table of Contents                                                                                             :TOC_3:noexport:
- [[#references][References]]
  - [[#config-file-headers][Config file headers]]
  - [[#customized-variables][Customized variables]]
- [[#global-constants][Global constants]]
  - [[#directories][Directories]]
- [[#personal-information][Personal Information]]
  - [[#set-full-name][Set full name]]
  - [[#set-email-address][Set email address]]
- [[#general-configuration][General configuration]]
  - [[#set-the-authentication-source-to-use][Set the authentication source to use]]
  - [[#disable-exit-confirmation][Disable exit confirmation]]
  - [[#keybindings][Keybindings]]
    - [[#remove-entire-line-when-at-the-beginning-c-k][Remove entire line when at the beginning =C-k=]]
    - [[#closes-the-current-buffer-c][Closes the current buffer =C=]]
    - [[#cycle-through-the-open-windows-c-w-c-w][Cycle through the open windows =C-w C-w=]]
    - [[#grab-open-link-from-application-c-c-g][Grab open link from application =C-c g=]]
  - [[#custom-functions][Custom functions]]
    - [[#insert-date][Insert date]]
    - [[#insert-a-timestamp][Insert a timestamp]]
    - [[#insert-custom-clock-entry-c-][Insert custom clock entry =C-'=]]
    - [[#insert-clipboard-image-c-m-y][Insert clipboard image =C-M-y=]]
    - [[#remove-all-results-from-an-org-document-s-][Remove all results from an org document =s-]=]]
  - [[#custom-keybindings][Custom keybindings]]
    - [[#open-files-from-the-bookmarks-list][Open files from the bookmarks list]]
- [[#visual-settings][Visual settings]]
  - [[#maximize-emacs-frame-on-startup][Maximize Emacs frame on startup]]
  - [[#theme][Theme]]
  - [[#fonts-and-icons][Fonts and Icons]]
    - [[#default-font][Default font]]
    - [[#variable-pitch][Variable pitch]]
    - [[#big-font][Big font]]
    - [[#enable-bolditalic-fonts][Enable bold/italic fonts]]
  - [[#set-custom-faces][Set custom faces]]
  - [[#line-settings][Line settings]]
    - [[#enable-line-numbers][Enable line numbers]]
    - [[#toggle-truncate-lines][Toggle Truncate lines]]
  - [[#mode-line-settings][Mode Line settings]]
    - [[#enable-the-display-of-time-and-date-in-the-mode-line][Enable the display of time and date in the mode line]]
    - [[#limit-mode-line-vcs-length][Limit mode line vcs length]]
- [[#package-configuration][Package configuration]]
  - [[#auto-dim-other-buffers][Auto dim other buffers]]
  - [[#deft][Deft]]
  - [[#dired][Dired]]
    - [[#enable-dual-pane][Enable dual pane]]
  - [[#forge][Forge]]
  - [[#magit][Magit]]
  - [[#ob-mermaid][Ob-mermaid]]
  - [[#org-mode][Org mode]]
    - [[#set-the-org-base-directory][Set the org base directory]]
    - [[#org-general-settings][Org general settings]]
    - [[#org-custom-functions][Org custom functions]]
    - [[#org-agenda][Org agenda]]
    - [[#org-calendar][Org calendar]]
    - [[#org-capture-templates][Org capture templates]]
    - [[#org-babel][Org babel]]
    - [[#org-bullets][Org bullets]]
    - [[#org-journal][Org journal]]
    - [[#org-roam][Org roam]]
  - [[#zoom-window][Zoom window]]
  - [[#smartparens][Smartparens]]
- [[#general-programming][General Programming]]
  - [[#css][CSS]]
  - [[#json][JSON]]
    - [[#c-c-c-f-json-beautify][=C-c C-f= Json beautify]]
  - [[#markdown][Markdown]]
- [[#programming][Programming]]
  - [[#cider][Cider]]
  - [[#clojure][Clojure]]

* References
** Config file headers
#+html: <details><summary>config.el</summary>
#+begin_src emacs-lisp :tangle config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file located at
;; https://gitlab.com/zzamboni/dot-doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
;; (setq user-full-name "John Doe"
;;      user-mail-address "john@doe.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; (setq doom-theme 'doom-one)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; (setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
;; (setq display-line-numbers-type t)

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src
#+html: </details>

** Customized variables

Doom [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#configure][does not recommend the Emacs =customize= mechanism]]:

#+begin_quote
/Note: do not use M-x customize or the customize API in general. Doom is designed to be configured programmatically from your config.el, which can conflict with Customize’s way of modifying variables./
#+end_quote

All necessary settings are therefore set by hand as part of this configuration file. The only exceptions are "safe variable" and "safe theme" settings, which are automatically saved by Emacs in =custom.el=, but this is OK as they don't conflict with anything else from the config.

* Global constants
** Directories

Base directories that are used for org/roam/deft

#+begin_src emacs-lisp
(setq my/home-dir "~")
(setq my/org-base-dir (concat my/home-dir "/Dropbox/notes/org/"))
#+end_src

* Personal Information

Let's set some variables with basic user information.

** Set full name
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Marco Pas")
#+END_SRC

** Set email address

#+BEGIN_SRC emacs-lisp
(setq user-mail-address "marco.pasopas@gmail.com")
#+END_SRC

* General configuration
** Set the authentication source to use

#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo"))
#+end_src

** Disable exit confirmation

#+begin_src emacs-lisp
(setq confirm-kill-emacs nil)
#+end_src

** Keybindings
*** Remove entire line when at the beginning =C-k=
When at the beginning of the line, make =Ctrl-K= remove the whole line, instead of just emptying it.

#+begin_src emacs-lisp
(setq kill-whole-line t)
#+end_src

*** Closes the current buffer =C=

Close the current buffer mapped to 'c' in normal mode.

#+begin_src emacs-lisp
(map! :map evil-normal-state-map
      :desc "Close the current buffer"
      :ng "c" #'kill-this-buffer)
#+end_src

*** Cycle through the open windows =C-w C-w=

#+begin_src emacs-lisp
(map! :map evil-normal-state-map
      :desc "Cycle through windows"
      :ng "C-w C-w" #'evil-window-next)
#+end_src

*** Grab open link from application =C-c g=

Shortcut to grab a link from an open Mac application.

#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda ()
                           (define-key org-mode-map (kbd "C-c g") 'org-mac-grab-link)))
#+end_src


** Custom functions

*** Insert date

#+begin_src emacs-lisp
(defun insert-date (arg)
  (interactive "P")
  (insert (if arg
              (format-time-string "%d.%m.%Y")
            (format-time-string "%Y-%m-%d"))))
#+end_src

*** Insert a timestamp

#+begin_src emacs-lisp
(defun insert-timestamp ()
  (interactive)
  (insert (format-time-string "%Y-%m-%dT%H:%M:%S")))
#+end_src

*** Insert custom clock entry =C-'=

#+begin_src emacs-lisp
(defun jx/insert-custom-clock-entry ()
  (interactive)
  (insert "CLOCK: ")
  (org-time-stamp-inactive)
  (insert "--")
  ;; Inserts the current time by default.
  (let ((current-prefix-arg '(4))) (call-interactively 'org-time-stamp-inactive))
  (org-ctrl-c-ctrl-c))

                                        ; Shortcut
(define-key evil-normal-state-map (kbd "C-'") 'jx/insert-custom-clock-entry)
(define-key evil-insert-state-map (kbd "C-'") 'jx/insert-custom-clock-entry)
#+end_src

