doom/.doom.d/config.org
*** Insert clipboard image =C-M-y=

Use the current headername as part of the image filename
#+begin_src emacs-lisp
(setq my/insert-clipboard-image-use-headername t)
#+end_src

Use the current buffername as part of the screenshot filename
#+begin_src emacs-lisp
(setq my/insert-clipboard-image-use-buffername t)
#+end_src

Function that allows a screenshot to be pasted in a Org-mode file. The relative link will be pasted into the document and a relative =./images= will be created to store the images.

#+begin_src emacs-lisp
;; Overview
;; --------
;; Inserts an image from the clipboard by prompting the user for a filename.
;; Default extension for the pasted filename is .png

;; A ./images directory will be created relative to the current Org-mode document to store the images.

;; The default name format of the pasted image is:
;; filename: <yyyymmdd>_<hhmmss>_-_<image-filename>.png

;; Important
;; --------
;; This function depends on 'pngpaste' to paste the clipboard image
;; -> $ brew install pngpaste

;; Basic Customization
;; -------------------
;; Include the current Org-mode header as part of the image name.
;; (setq my/insert-clipboard-image-use-headername t)
;; filename: <yyyymmdd>_<hhmmss>_-_<headername>_-_<image-filename>.png

;; Include the buffername as part of the image name.
;; (setq my/insert-clipboard-image-use-buffername t)
;; filename: <yyyymmdd>_<hhmmss>_-_<buffername>_-_<image-filename>.png

;; Full name format
;; filename: <yyyymmdd>_<hhmmss>_-_<buffername>_-_<headername>_-_<image-filename>.png
(defun my/insert-clipboard-image (filename)
  "Inserts an image from the clipboard"
  (interactive "sFilename to paste: ")
  (let ((file
         (concat
          (file-name-directory buffer-file-name)
          "images/"
          (format-time-string "%Y%m%d_%H%M%S_-_")
          (if (bound-and-true-p my/insert-clipboard-image-use-buffername)
              (concat (s-replace "-" "_"
                                 (downcase (file-name-sans-extension (buffer-name)))) "_-_")
            "")
          (if (bound-and-true-p my/insert-clipboard-image-use-headername)
              (concat (s-replace " " "_" (downcase (nth 4 (org-heading-components)))) "_-_")
            "")
          filename ".png")))

    ;; create images directory
    (unless (file-exists-p (file-name-directory file))
      (make-directory (file-name-directory file)))

    ;; paste file from clipboard
    (shell-command (concat "pngpaste " file))
    (insert (concat "[[./images/" (file-name-nondirectory file) "]]"))))
#+end_src

Bind insert clipboard image to Ctrl-Option-y

#+begin_src emacs-lisp
(map! :desc "Insert clipboard image"
      :n "C-M-y" 'my/insert-clipboard-image)
#+end_src

*** Remove all results from an org document =s-]=
#+begin_src emacs-lisp
(defconst help/org-special-pre "^\s*#[+]")
(defun help/org-2every-src-block (fn)
  "Visit every Source-Block and evaluate `FN'."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (let ((case-fold-search t))
      (while (re-search-forward (concat help/org-special-pre "BEGIN_SRC") nil t)
        (let ((element (org-element-at-point)))
          (when (eq (org-element-type element) 'src-block)
            (funcall fn element)))))
    (save-buffer)))

(after! org
   (define-key org-mode-map (kbd "s-]") (lambda () (interactive)
                                       (help/org-2every-src-block
                                        'org-babel-remove-result))))
#+end_src

** Custom keybindings
*** Open files from the bookmarks list
#+begin_src emacs-lisp
(map! :desc "Open bookmarks list"
      :n "C-c b" 'list-bookmarks)
#+end_src

* Visual settings
** Maximize Emacs frame on startup

#+begin_src emacs-lisp
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
#+end_src

** Theme

Sets the default theme

#+begin_src emacs-lisp
(setq doom-theme 'doom-vibrant)
(setq doom-vibrant-brighter-comments t  ;; "If non-nil, more vivid colors will be used to style the mode-line."
      doom-vibrant-brighter-modeline t  ;; "If non-nil, comments will be highlighted in more vivid colors."
      doom-vibrant-comment-bg t)        ;; "If non-nil, comments will have a subtle, darker background. Enhancing their legibility."
#+end_src
** Fonts and Icons
*** Default font

doom-font is the default font for emacs to use

#+begin_src emacs-lisp
;; (setq doom-font (font-spec :family "FiraCode Nerd Font Mono" :size 16))
#+end_src

*** Variable pitch

doom-variable-pitch-font is a proportional font used for reading emails, doc etc.

#+begin_src emacs-lisp
;; (setq doom-variable-pitch-font (font-spec :family "Ubuntu" :size 14))
#+end_src

*** Big font

doom-big-font is the default font to use for doom-big-font-mode

#+begin_src emacs-lisp
;; (setq doom-big-font (font-spec :family "FiraCode Nerd Font Mono" :size 30))
#+end_src

*** Enable bold/italic fonts

#+begin_src emacs-lisp
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
#+end_src

** Set custom faces

#+begin_src emacs-lisp
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

** Line settings
I have toggled display-line-numbers-type so I have line numbers displayed.  Doom Emacs uses 'SPC t' for "toggle" commands, so I choose 'SPC t t' for toggle-truncate-lines.

*** Enable line numbers

#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src

*** Toggle Truncate lines

#+begin_src emacs-lisp
(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)
#+end_src

** Mode Line settings
*** Enable the display of time and date in the mode line

#+begin_src emacs-lisp
(display-time-mode 1)
(setq display-time-day-and-date t)
#+end_src

*** Limit mode line vcs length

#+begin_src emacs-lisp
(setq doom-modeline-vcs-max-length 80)
#+end_src

#+begin_src emacs-lisp
(after! doom-modeline
  (setq doom-modeline-bar-width 3))
#+end_src
* Package configuration
** Auto dim other buffers

The auto-dim-other-buffers-mode is a global minor mode which makes windows without focus less prominent. With many windows in a frame, the idea is that this mode helps recognise which is the selected window by providing a non-intrusive but still noticeable visual indicator.

#+begin_src emacs-lisp
(add-hook 'after-init-hook (lambda ()
  (when (fboundp 'auto-dim-other-buffers-mode)
    (auto-dim-other-buffers-mode t))))
#+end_src

** Deft

#+begin_src emacs-lisp
(setq deft-directory my/org-base-dir
      deft-default-extension "org"
      deft-extensions '("txt" "md" "org")
      deft-recursive t
      deft-use-filename-as-title t
      deft-use-filter-string-for-filename t
      deft-file-naming-rules '((noslash . "-")
                               (nospace . "-")
                               (case-fn . downcase)))
#+end_src

** Dired

*** Enable dual pane

Enable Dired to use a dual pane layout. If non-nil, Dired tries to guess a default target directory. This means: if there is a Dired buffer displayed in the next window, use its current directory, instead of this Dired buffer's current directory.

Go to dired, split your window, split-window-vertically & go to another dired directory. When you will press C to copy, the other dir in the split pane will be default destination.

#+begin_src emacs-lisp
(setq dired-dwim-target t)
#+end_src

** Forge

#+begin_src emacs-lisp
;; Configure number of topics show, open and closed
;; use negative number to toggle the view of closed topics
;; using `forge-toggle-closed-visibility'
(setq  forge-topic-list-limit '(100 . -10))

;; set closed to 0 to never show closed issues
;; (setq  forge-topic-list-limit '(100 . 0))
#+end_src

