doom/.doom.d/config.org
** Magit

Functions to open links to the files in a Git Repo. This is shameless taken from [[https://gist.github.com/dotemacs/9a0433341e75e01461c9][GitHub Gist]] and [[https://github.com/arthurcgusmao/acg-emacs/commit/2257058e424b82e1d670cadf2e870f0a6a37d669][ACG Emacs]]

#+begin_src emacs-lisp
(defun acg/parse-git-remote-url (url)
  "If necessary, convert an SSH to HTTPS git remote location."
  (if (string-match "^http" url)
      url
    (replace-regexp-in-string "\\(.*\\)@\\(.*\\):\\(.*\\)\\(\\.git?\\)"
                              "https://\\2/\\3"
                              url)))

(defun acg/magit-open-remote-repo ()
  "Opens a remote repo URL. Prompts the user to choose a remote."
  (interactive)
  (let* ((remote-name (magit-read-remote "Choose remote repository"))
         (url (magit-get "remote" remote-name "url")))
    (browse-url (acg/parse-git-remote-url url))
    (message "Opening repo %s" url)))

(defun acg/project-get-root-relative-path (&optional path)
  "Returns PATH relative to a project root."
  (let* ((path (expand-file-name (or path default-directory)))
         (root-path (expand-file-name
                     (cdr (project--find-in-directory path))))
         (root-length (length root-path))
         (rel-path (substring path root-length)))
    rel-path))

(defun acg/magit-open-remote-dwim (&optional dir)
  "Opens a remote repo URL in the exact DIR location. Prompts the user to choose a remote."
  (interactive)
  (let* ((file (buffer-file-name))
         (dir (expand-file-name (or dir default-directory)))
         (remote-name (magit-read-remote "Choose remote repository" nil t))
         (url (acg/parse-git-remote-url
               (magit-get "remote" remote-name "url")))
         ;; Identify remote hosting type (e.g., GitHub, GitLab, etc.)
         (remote-hosting-type
          (cond
           ((string-match-p (regexp-quote "github") url) "GitHub")
           ((string-match-p (regexp-quote "gitlab") url) "GitLab")
           (t (completing-read "Choose remote hosting type:"
                               '("GitHub" "GitLab"))))))
    ;; Adapt to GitLab's URL standard
    (when (string= remote-hosting-type "GitLab")
      (setq url (concat url "/-")))
    ;; Adapt to differences in file and directory URL paths
    (if file
        (setq url (concat url "/blob/" (magit-get-current-branch)
                          "/" (acg/project-get-root-relative-path file)))
      (setq url (concat url "/tree/" (magit-get-current-branch)
                        "/" (acg/project-get-root-relative-path dir))))
    ;; Perform actions
    (browse-url url)
    (message "Opening %s" url)))
#+end_src

** Ob-mermaid

[[https://mermaid-js.github.io/][Mermaid]] lets you create diagrams using text and code. [[https://github.com/arnm/ob-mermaid][Ob-mermaid]] enables the use of this inside Org-mode.

Set the path to the Mermaid CLI, this has been installed using =brew install mermaid-cli== but the executable is named mmdc.
#+begin_src emacs-lisp
(setq ob-mermaid-cli-path "/usr/local/bin/mmdc")
#+end_src

** Org mode

*** Set the org base directory

Set base directory where org mode can find the org files

If you use `org' and don't want your org files in the default location below,
change `org-directory'. It must be set before org loads!

#+begin_src emacs-lisp
(setq org-directory my/org-base-dir)
#+end_src

*** Org general settings

Hide the markers (*,_, ...) when making text bold/italic etc

#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

<<org-duration-format>>Set the output of the duration format to =hours:min= so we can sum these later on in org tables. The default format when passing 24 hours is 1d .. As we need to sum the duration we need the actual hours.

#+begin_src emacs-lisp
(setq org-duration-format 'h:mm)
#+end_src

Use Org Log =done= to auto insert a 'CLOSED' property when changing state below the heading. This is used for =ox-hugo= that ox-hugo auto-sets the date field in the front-matter to the time stamp in that CLOSED property. For more information see [[https://ox-hugo.scripter.co/doc/org-capture-setup/][Org Hugo capture setup]].

#+begin_src emacs-lisp
(setq org-log-done 'time)
#+end_src

Set default todo/tasks states

#+begin_src emacs-lisp
(after! org
  (setq org-todo-keywords
      '((sequence "TODO" "DOING" "BLOCKED" "|" "DONE" "ARCHIVED"))))
#+end_src

Set the refile targets

#+begin_src emacs-lisp
  (setq org-refile-targets '((org-agenda-files :maxlevel . 9)))
#+end_src

With (setq org-tags-match-list-sublevels 'indented), a number of dots equal to the level will be prepended to each agenda line to indicate its level.

#+begin_src emacs-lisp
(after! org
  (setq org-tags-match-list-sublevels 'indented))
#+end_src

Set the location of the tags, use =SPC-u C-c C-c= to re-align of needed.

#+begin_src emacs-lisp
(after! org
  (setq org-tags-column -120))
#+end_src

Remove category display for todo items

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-prefix-format
        '((agenda . " %i %-12:c%?-12t% s")
          (todo   . " ")
          (tags   . " %i %-12:c")
          (search . " %i %-12:c"))))
#+end_src

Set the size of images shown in org mode

#+begin_src emacs-lisp
(after! org
  (setq org-image-actual-width (/ (display-pixel-width) 2)))
#+end_src

*** Org custom functions

**** Return a list of files that have clockable items

#+begin_src emacs-lisp
(defun clockable-files ()
  "Returns org files that contain clockable items"
  (directory-files-recursively (concat my/org-base-dir "journal/") ".org"))
#+end_src

**** Function to change the format of a duration to HH:MM

This function can be applied to a table. Using a =#+TBLFMT:=. I am using this function to enable [[https://github.com/tbanel/orgaggregate][Org Aggregate]] time duration sums. The expected format for the time durations is =HH:MM=.

Also check the correct setting for [[org-duration-format][org-duration-format]]

#+BEGIN_EXAMPLE
;; Convert the time strings in column $3 and place them in column $5, also set the header of column $5
#+TBLFM: $5='(convert-org-clocktable-time-to-hhmm $3)::@1$5='(format "%s" "T")
#+END_EXAMPLE

#+begin_src emacs-lisp
(defun convert-org-clocktable-time-to-hhmm (time-string)
  "Converts a time string to HH:MM"
  (if (> (length time-string) 0)
      (progn
        (let* ((s (s-replace "*" "" time-string))
               (splits (split-string s ":"))
               (hours (car splits))
               (minutes (car (last splits)))
               )
          (if (= (length hours) 1)
              (format "0%s:%s" hours minutes)
            (format "%s:%s" hours minutes))))
    time-string))
#+end_src

*** Org agenda

Hide tags in the org-agenda todo list

#+begin_src emacs-lisp
  (setq org-agenda-hide-tags-regexp ".")
#+end_src

Set the files that are used to fill org agenda

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files
        (append (list (concat my/org-base-dir "inbox.org")
                      (concat my/org-base-dir "agenda.org"))
                (directory-files-recursively (concat my/org-base-dir "journal/")  "\\.org$"))))
#+end_src

Set the time span for the agenda overview

#+begin_src emacs-lisp
;; (setq org-agenda-start-day -2)
;; (setq org-agenda-span 3)
;; (setq org-agenda-start-day "+3d")
#+end_src

*** Org calendar

#+begin_src emacs-lisp
(after! org
  (setq calendar-week-start-day 1)
  (setq calendar-intermonth-text
        '(propertize
          (format "%2d"
                  (car
                   (calendar-iso-from-absolute
                    (calendar-absolute-from-gregorian (list month day year)))))
          'font-lock-face 'font-lock-warning-face))
  (setq calendar-intermonth-header
        (propertize "Wk"                  ; or e.g. "KW" in Germany
                    'font-lock-face 'font-lock-keyword-face)))
#+end_src

