doom/.doom.d/config.org
*** Org capture templates

Function that returns a Hugo post capture template.

#+begin_src emacs-lisp
(defun org-hugo-new-subtree-post-capture-template ()
  "Returns `org-capture' template string for new Hugo post.
   See `org-capture-templates' for more information."
  (let* ((title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
         (fname (org-hugo-slug title)))
    (mapconcat #'identity
               `(
                 ,(concat "* TODO " title)
                 ":PROPERTIES:"
                 ,(concat ":EXPORT_FILE_NAME: " fname)
                 ":END:"
                 "%?\n")          ;Place the cursor here finally
               "\n")))
#+end_src

Set the to be be used capture templates!

#+begin_src emacs-lisp
(after! org
  ;; clean the intial existing template list
  (setq org-capture-templates '())


  ;; add inbox capture template
  (add-to-list 'org-capture-templates
               `("i" "Inbox" entry (file+headline "inbox.org" "Inbox")
                 ,(concat "** TODO %?\n"
                          "/Entered on/ %U")))

  ;; add meeting capture template
  (add-to-list 'org-capture-templates
               `("m" "Meeting" entry (file+headline "agenda.org" "Planned")
                 ,(concat "* %? :meeting:\n"
                          "<%<%Y-%m-%d %a %H:00>>")))

  ;; add hugo capture template
  (add-to-list 'org-capture-templates
               '("h"                ;`org-capture' binding + h
                 "Hugo post"
                 entry
                 ;; It is assumed that below file is present in `org-directory'
                 ;; and that it has a "Blog Ideas" heading. It can even be a
                 ;; symlink pointing to the actual location of all-posts.org!
                 (file+olp "~/Dropbox/notes/org/blog/blog.org" "Posts")
                 (function org-hugo-new-subtree-post-capture-template) :prepend t)))
#+end_src

#+RESULTS:
| h | Hugo post | entry | (file+olp ~/Dropbox/notes/org/blog/blog.org Posts) | #'org-hugo-new-subtree-post-capture-template | :prepend | t |
| m | Meeting   | entry | (file+headline agenda.org Planned)                 | * %? :meeting:                               |          |   |

*** Org babel

#+begin_src emacs-lisp
(setq org-babel-clojure-backend 'cider)
#+end_src

#+begin_src emacs-lisp
(after! 'org
            (org-babel-do-load-languages 'org-babel-load-languages
                                         (append org-babel-load-languages
                                                 ;; '((julia . t))
                                                 '((gnuplot . t))
                                                 ))
            )
;; (!after org
;;         (org-babel-do-load-languages
;;          'org-babel-load-languages
;;          '(
;;            (python     . t)
;;            (ruby       . t)
;;            (calc       . t)
;;            (ditaa      . t)
;;            (dot        . t)
;;            (emacs-lisp . t)
;;            (gnuplot    . t)
;;            (latex      . t)
;;            (plantuml   . t)
;;            (python     . t)
;;            (ruby       . t)
;;            (shell      . t)
;;            (sqlite     . t)
;;            (sql        . t))))
#+end_src

*** Org bullets

Make sure we have nice bullets for org headings.
#+begin_src emacs-lisp
(setq org-superstar-headline-bullets-list '("⁖" "◉" "○" "✸" "✿"))
#+end_src

*** Org journal

Set the location of the journal files.

#+begin_src emacs-lisp
(setq org-journal-dir (concat my/org-base-dir "journal"))
#+end_src

A better title for a journal entry, instead of using a top header with the date, we use the TITLE meta field.

#+begin_src emacs-lisp
(setq org-journal-date-prefix "#+TITLE: ")
#+end_src

Normally the hours level is a second level heading, change that to first level.

#+begin_src emacs-lisp
(setq org-journal-time-prefix "* ")
#+end_src

Use a better date format: day, year-month-day.

#+begin_src emacs-lisp
(setq org-journal-date-format "%a, %Y-%m-%d")
#+end_src

Set a good format for the journal file e.g. year-month-day with a .org extensions.

#+begin_src emacs-lisp
(setq org-journal-file-format "%Y-%m-%d.org")
#+end_src

Enable integration with org-agenda so we can view the entries.

#+begin_src emacs-lisp
(setq org-journal-enable-agenda-integration t)
#+end_src

# Set default tags to be used for journal entries

#+begin_src emacs-lisp
(setq org-journal-tag-persistent-alist '(
                                         ("@work" . ?w)
                                         ("@private" . ?p)
                                         ("fontys" . ?f)
                                         ("ctoprogram" . ?c)
                                         ("integrationlab" . ?i)
                                         ("swat" . ?s)
                                         ("interruption" . ?!)
                                         ("various" . ?v)
                                         ))
#+end_src

*** Org roam

Set the default path to Org-roam files.

#+begin_src emacs-lisp
(setq org-roam-directory (concat my/org-base-dir "roam"))
#+end_src

If non-nil, open the org-roam buffer when opening an org roam file. I set it to nil so the roam buffer will not show every time i open a org file.

#+begin_src emacs-lisp
(setq +org-roam-open-buffer-on-find-file nil)
#+end_src

** Zoom window

Make it possible to zoom in/out the current window.

#+begin_src emacs-lisp
;; https://github.com/emacsorphanage/zoom-window
(custom-set-variables
 '(zoom-window-mode-line-color "purple"))
(map! :desc "Zoom/Unzoom the current window"
      :n "C-w z" 'zoom-window-zoom)
#+end_src

** Smartparens

Smartparens is a minor mode for dealing with pairs in Emacs.

#+begin_src emacs-lisp
(after! smartparens
  (add-hook! (clojure-mode emacs-lisp-mode lisp-mode cider-repl-mode) :append #'smartparens-strict-mode))
(map!
 :map smartparens-mode-map
 ;; smartparens maps (navigation ops)
 :nvie "C-M-f" #'sp-forward-sexp
 :nvie "C-M-b" #'sp-backward-sexp
 :nvie "C-M-u" #'sp-backward-up-sexp
 :nvie "C-M-d" #'sp-down-sexp
 ;; smartparens maps (split join slurp barf)
 :nie "M-s" #'sp-split-sexp
 :nie "M-j" #'sp-join-sexp
 :nvie "C->" #'sp-forward-slurp-sexp
 :nvie "C-<" #'sp-forward-barf-sexp
 :nvie "C-{" #'sp-backward-slurp-sexp
 :nvie "C-}" #'sp-backward-barf-sexp)
#+end_src

* General Programming
** CSS
Set default indentation for css to 2 spaces

#+begin_src emacs-lisp
(after! css-mode
  (setq css-indent-offset 2))
#+end_src
** JSON
Lets format JSON with a specific width

#+begin_src emacs-lisp
(setq json-reformat:indent-width 2)
#+end_src

*** =C-c C-f= Json beautify

#+begin_src emacs-lisp
(map! :desc "JSON beautify"
      :n "C-c C-f" 'json-mode-beautify)
#+end_src

** Markdown
#+begin_src emacs-lisp
(map! :localleader
      :map markdown-mode-map
      :prefix ("i" . "Insert")
      :desc "Blockquote"    "q" 'markdown-insert-blockquote
      :desc "Bold"          "b" 'markdown-insert-bold
      :desc "Code"          "c" 'markdown-insert-code
      :desc "Emphasis"      "e" 'markdown-insert-italic
      :desc "Footnote"      "f" 'markdown-insert-footnote
      :desc "Code Block"    "s" 'markdown-insert-gfm-code-block
      :desc "Image"         "i" 'markdown-insert-image
      :desc "Link"          "l" 'markdown-insert-link
      :desc "List Item"     "n" 'markdown-insert-list-item
      :desc "Pre"           "p" 'markdown-insert-pre
      (:prefix ("h" . "Headings")
        :desc "One"   "1" 'markdown-insert-header-atx-1
        :desc "Two"   "2" 'markdown-insert-header-atx-2
        :desc "Three" "3" 'markdown-insert-header-atx-3
        :desc "Four"  "4" 'markdown-insert-header-atx-4
        :desc "Five"  "5" 'markdown-insert-header-atx-5
        :desc "Six"   "6" 'markdown-insert-header-atx-6))
#+end_src

* Programming
** Cider
Make the Cider popup window appear in the right hand side.

#+begin_src emacs-lisp
(after! cider
  (set-popup-rule! "^\\*cider-repl" :side 'right :size 0.3 :quit nil :ttl 0))
#+end_src

** Clojure
